---
kind: method
id: M:Autodesk.Revit.DB.Curve.CreateReversed
zh: 曲线
source: html/722a403d-a95c-557c-e92e-ad6757dc421c.htm
---
# Autodesk.Revit.DB.Curve.CreateReversed Method

**中文**: 曲线

Creates a new curve with the opposite orientation of the existing curve.

## Syntax (C#)
```csharp
public Curve CreateReversed()
```

## Returns
The new curve.